
#include <iostream>
using namespace std;
int main()
{
	int x, x2 = 1, reverse = 0, digit;
	//в началото x2 е 1, защото ако имаме водещи нули, те че изчезнат, защото
	//са незначещи, а по този начин се складират като 0 след единицата
	cin >> x;
	
	while (x != 0) //преобразуваме числото както бихме направили на хартия	
	{
		digit = x % 2;
		x2 = x2 * 10 + digit;
		x /= 2;
	}
	while (x2 != 0) //обръщаме числото, защото то е в обратен ред
	{
		digit = x2 % 10;
		reverse = reverse * 10 + digit;
		x2 /= 10;
	}
	reverse /= 10; //премахваме единицата от x2, която добавихме в началото, за да няма незначещи водещи нули

	cout << reverse << endl;
	return 0;
}